function rangcode = generaterangcode(PRN)
g2s =  [1335, 466, 633, 497,1466,1276, 736,1004, 498,1688,...
        1337, 468, 499, 944,1468,1278,1689,1338, 636, 500,...
         945,1469,1690, 470, 637, 501, 946,1340, 471, 638,...
         502,1693,1342, 473,1694,1343,1695];
%% 生成g1
g1=zeros(1,2047);
reg=[-1,1,-1,1,-1,1,-1,1,-1,1,-1];
for i=1:2047
    g1(i)       = reg(11);
    saveBit     = -(reg(1)*reg(7)*reg(8)*reg(9)*reg(10)*reg(11));
    reg(2:11)   = reg(1:10);
    reg(1)      = saveBit;
end
%% 生成g2
g2=zeros(1,2047);
reg=[-1,1,-1,1,-1,1,-1,1,-1,1,-1];
for i=1:2047
    g2(i)       = reg(11);
    saveBit     = -(reg(1)*reg(2)*reg(3)*reg(4)*reg(5)*reg(8)*reg(9)*reg(11));
    reg(2:11)   = reg(1:10);
    reg(1)      = saveBit;
end
%g2加偏移
g2 = circshift(g2,[0,g2s(PRN)]);
%% 生成测距码
%注意需要截短一个码片
rangcode = -(g1(1:2046).*g2(1:2046));